Hi @blame19 thanks for reporting this. I had a look and unfortunately I was not able to reproduce it myself.

Initial plan and apply on 2.7.0:
```
% terraform plan -out=plan 

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_public_ip.example will be created
  + resource "azurerm_public_ip" "example" {
      + allocation_method       = "Static"
      + availability_zone       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "catTestPublicIp1"
      + resource_group_name     = "cat-test"
      + sku                     = "Standard"
      + tags                    = {
          + "environment" = "Production"
        }
      + zones                   = (known after apply)
    }

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "cat-test"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"
% terraform -version
Terraform v1.0.1
on darwin_amd64
+ provider registry.terraform.io/hashicorp/azurerm v2.70.0

Your version of Terraform is out of date! The latest version
is 1.0.5. You can update by downloading from https://www.terraform.io/downloads.html

 % terraform apply "plan"
azurerm_resource_group.example: Creating...
azurerm_resource_group.example: Creation complete after 0s [id=/subscriptions/xxxxx/resourceGroups/cat-test]
azurerm_public_ip.example: Creating...
azurerm_public_ip.example: Creation complete after 2s [id=/subscriptions/xxxxx/resourceGroups/cat-test/providers/Microsoft.Network/publicIPAddresses/catTestPublicIp1]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

Plan after upgrading to 2.7.1 and including sku_tier in tf file:

```
 % terraform plan -out=plan 
azurerm_resource_group.example: Refreshing state... [id=/subscriptions/xxxx/resourceGroups/cat-test]
azurerm_public_ip.example: Refreshing state... [id=/subscriptions/xxxx/resourceGroups/cat-test/providers/Microsoft.Network/publicIPAddresses/catTestPublicIp1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

 % terraform plan -out=plan 
azurerm_resource_group.example: Refreshing state... [id=/subscriptions/xxxx/resourceGroups/cat-test]
azurerm_public_ip.example: Refreshing state... [id=/subscriptions/xxxx/resourceGroups/cat-test/providers/Microsoft.Network/publicIPAddresses/catTestPublicIp1]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":

  # azurerm_public_ip.example has been changed
  ~ resource "azurerm_public_ip" "example" {
        id                      = "/subscriptions/xxxx/resourceGroups/cat-test/providers/Microsoft.Network/publicIPAddresses/catTestPublicIp1"
      + ip_tags                 = {}
        name                    = "catTestPublicIp1"
      + sku_tier                = "Regional"
        tags                    = {
            "environment" = "Production"
        }
        # (9 unchanged attributes hidden)
    }
  # azurerm_resource_group.example has been changed
  ~ resource "azurerm_resource_group" "example" {
        id       = "/subscriptions/xxxx/resourceGroups/cat-test"
        name     = "cat-test"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

No changes. Your infrastructure matches the configuration.

Your configuration already matches the changes detected above. If you'd like to update the Terraform state to match, create and apply a refresh-only plan:
  terraform apply -refresh-only
% terraform -version
Terraform v1.0.1
on darwin_amd64
+ provider registry.terraform.io/hashicorp/azurerm v2.71.0

```

Is there any other information that could help with reproducing this?